Level 1: Matching

Match definitions: Player must match the definition with the correct word (i.e. argument, evidence, ethos, etc.)

Resolution: the topic or claim that is being debated. Example: The death penalty is a justified method of punishment.
Evidence: information used to support a claim.
Refutation: the process of attacking an opponent's arguments.
Claim: a controversial statement that a debater supports or refutes with evidence and reasoning.
Reasoning: using analysis to connect the evidence to the claim.
Ethos: this is the Greek word for ethics or character and focuses on demonstrating the debaters’ trustworthiness, dependability or preparedness.
Pathos: this is the Greek word that means both experience and suffering and during a debate it focuses on convincing the audience with emotion.
Logos: this is the Greek word for logic and focuses on the message and appeal to authority or credibility by offering expertise, research, or data to support arguments.
Structural Barrier: are laws, supreme court decisions, and executive branch policies that would keep a new policy from existing.
Attitudinal Barrier: are mindsets that would block certain policies or laws. The president (and cabinet), congressional leaders, court justices, interest groups, and the public all have the power to keep policies from existing.


Match argument to persuasion technique (i.e. Statement A <-> pathos)
Proposal Example: The government should implement a tax on pollution to create a healthier environment.
Ethos (Ethics) - We have an obligation to protect other species and the planet for our children and future generations.
Pathos (Emotion) - Pollution causes animals to suffocate and die, birds to be covered with tar and unable to fly and disease for our nation.
Logos (Logic) - Pollution is a systemic risk to our ecosystem, causing thousands of children to become ill each year, which results in millions of dollars in medical bills.

Proposal Example: Teachers should be paid a higher wage.
Ethos (Ethics) - Researchers illustrate that paying teachers more increases long-term socioeconomic gains for students and their families which we need to increase the prosperity of our country.
Pathos (Emotion) - Teachers often work long hours and spend more time with their students than their own family. Teachers have the added responsibility of educating the future generation.
Logos (Logic) - 75% of teachers take home 20% less than they need to support themselves and their families.

Proposal Example: The death penalty is an unjustified method of punishment.
Ethos (Ethics) - According to researchers, the death penalty does not deter crime and we as citizens can utilize more human methods to rehabilitate those that break the law.
Pathos (Emotion) - Innocent lives are taken by the death penalty and families are forced to deal with the trauma of losing a loved one.
Logos (Logic) - In 10% of death penalty cases, innocent people are mistakenly identified as guilty.
